// 武术百科组件
<template>
  <div class="ebcyclopedia-container">
    <div class="header">
      <h2>武术百科</h2>
      <el-link type="success" :underline="false"
        >刷新百科<i class="el-icon-refresh"></i
      ></el-link>
    </div>
    <div class="news" v-for="(item, index) in newsList" :key="index">
      <div class="news-list" @click="previewEbcycl(item)">
        <div class="news-left">
          <el-image :src="item.title_img" fit="fill"></el-image>
        </div>
        <div class="news-right">
          <h3>{{ item.title }}</h3>
          <p>
            {{ item.intro }}
          </p>
          <div class="news-footer">
            <span
              >点击量 <b>{{ item.clickNum }}</b></span
            >
            <span>{{ item.createTime }}</span>
          </div>
        </div>
      </div>
    </div>
    <!-- 预览 -->
    <ebcycl-preview ref="EbcyclPreview" :data="currEbcycl"></ebcycl-preview>
  </div>
</template>

<script>
// 百科详情预览组件
import EbcyclPreview from './components/ebcycl-detail'
export default {
  name: 'ebcyclopediaIndex',
  components: {
    EbcyclPreview
  },
  props: {},
  data() {
    return {
      newsList: [
        {
          id: 1,
          username: 'admin',
          title_img: require('@/assets/ebcycl/news01.png'),
          title: '劲力是传统武术的本质追求',
          intro:
            '导读：无论是聚柔成刚的“惊炸”劲,还是化刚为柔的“粘绵”劲,劲力一直是传统武术习练以及研究的主要内容。文章从劲力是传统武术发展的需要、劲力是传统武术技击价值的保障、劲力是传统武术文化的重要载体、劲力是传统武术门派追求的核心几个角度论述了劲力在传统武术习练、传承中具有重要的地位,得出劲力是传统武术本质追求的结论。',
          content: `<h2>1 劲力是传统武术发展的需要</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;中华武术在很久以前就具有“表演”和“击杀”的双重价值。传统武术是融技击价值和表演价值为一体的。随着人们审美追求的提高，传统武术仅仅依靠“花拳绣腿”很难产生巨大的吸引力，然而劲力是传统武术永无止境的追求，也是吸引广大观众眼球的一大亮点。劲力是武术运动中独特的概念，是武术的灵魂，是人体运用武术动作发出的一种意、气、力三者高度协调配合的整体性力量，是传统武术中最能产生震撼力的地方，因此，传统武术表演离不开劲力。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;中国传统武术有很多招法都能致人于伤残，如“狠招”、“毒招”、“绝招”。如拳谚讲“上打咽喉下打阴，中打两肋并当心，还有两膝和两臁（指小腿，脑后一掌见真魂”，形意拳经云“起如风，落如箭，打到还嫌慢”，八极拳的劲力“动如绷弓，发若炸雷”。拳谚描述的招法和劲力在传统武术实战中未必就招招好用，力透心脾。可是这些“绷弓”、“炸雷”的“惊炸”劲，如果打到身上，即便不打咽喉和后脑等重要部位，也足以伤其筋断其骨。在这个时候传统武术劲力就成为一个很好的交流和“止戈”的平台，不论过去武举比赛的选拔人才，还是现在的全国武术功力大赛，劲力的展示一直是评判选拔优秀武术人才的重要指标。武术家们的交手以及给挑战者全身而退的劝导，很多时候用的就是巧妙的劲力，所谓“行家一出手就知有没有”说的就是这个道理。</p>
            <h2>2 劲力是传统武术技击价值的保障</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;戚继光在《纪效新书》中所再三强调的“既得艺，必试敌”，技击实用功能是传统武术发展过程中一直存在的核心价值。不论是冷兵器时代，还是当今社会，抛开武术的技击功能，武术就会失去大批的追求者和膜拜者，失去大片的生存空间。传统武术的技击功能更是丰富博大，让广大武术爱好者迷恋。但是，不管怎样高妙的技击手段，离开劲力就无从谈起。没有劲力，一切拳架招法都是中看不中用的“花拳绣腿”。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;王芗斋搭手飞人的神技，张恩桐一触即发的功夫，王选杰劲吐人跌，这些均得益于大成拳的劲力。有了劲力太极拳，名家们才能在浑然不觉的状态下发放对手，自立于不败之地。同样，正是具备了强大的劲力那些身材弱小的武术家们才能轻松战胜身材高大的对手，“神枪李书文”据说身材并不高大魁梧，却能以武扬威，声名远播，很大程度上源于他收发自如、功力深厚的劲力。许多传统武术功夫大家，都练就了常人所不具备的劲力，这些劲力让他们赢得了武林中的地位，得到后人的敬佩和叹服。所以说，劲力是传统武术的技击保障。踢打摔拿的任何一项技术，都需要力量和劲力。有劲力这些技击手段才能发挥，劲力越好这些技击手段越发挥的淋漓酣畅</p>
            <h2>3 劲力是传统武术文化的重要载体</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;传统武术的研究随着时代的发展也在发生着变化，近年来武术文化的研究也日渐丰富，成为武术研究的一个热门方向。传统武术劲力在武术文化的传承与研究中起着重要的作用。不论是武侠小说，还是武打影视，甚至是武林轶事，这些文化载体里面有很多对传统武术劲力的描述、记载。这些对劲力的描述记载有的是事实或接近事实，有的纯粹是艺术的夸张和渲染，但是正是这些文化载体传对传统武术劲力的宣传，衍生和丰富了传统武术文化，使武术文化成为文化研究中一道独特的风景</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;李小龙在电影里表现出来的超人爆发力（劲力），引发了咏春拳学习研究的热潮，进而上升到武德修养、民族大义等文化的层面，对观众进行教育和感化；金庸小说中的“降龙十八掌”、“乾坤大挪移”等夸张的功法劲力，武林轶事里“发人丈许外”“、铁掌开石砖”的劲力，吸引着、教化着、约束着广大武术爱好者，在人的内心世界形成一种无形的武术文化。少林寺千佛殿的脚坑，让人们不得不感叹少林拳脚下的劲力，不但使少林拳威名远扬，更给少林拳增添了许多文化底蕴。李仲轩晚年讲述的《逝去的武林》，隐约中闪现的形意拳超乎常人的劲力及练功方法，吸引了很多人，导致武术爱好者对传统武术的又一次狂热和深思，让人们对传统武术文化有了更清醒和理性的思考。可以这样说：如果没有传统武术劲力留下的武术传说和史实，我们的武术文化也会失去很多鲜活而生动的素材。</p>`,
          clickNum: 666,
          createTime: '2020-10-10 10:10:10'
        },
        {
          id: 2,
          username: 'admin',
          title_img: require('@/assets/ebcycl/news02.gif'),
          title: '古拳谱中“千斤坠”是什么？',
          intro:
            '导读：根据牛顿的物理定律，武侠上描写的气沉丹田，灌劲于腿上，就能抵抗外力，甚至十余条大汉也推他不倒。如果方法只是运运气，自然做不到上面这点，因为任何人只要拦腰一抱，就将他抱起了，人不过就百八斤重量，有什么难的。',
          content: `<p>&nbsp;&nbsp;&nbsp;&nbsp;人的身体重量是人最大的潜力所在，一百多斤的重量如果能够快速砸向对方，相信只要速度够快，是势不可挡的，关键在于如何实现重心的快速位移。内脏相对于人体而言是人体的内核与中心，如瓶中之水，上下窜动会带来整体向某一方向的冲击力，当内脏实现了快速提坠，则可以驱使身体位移产生能量。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;“千斤坠”是指在向下发劲时，用“横隔肌”惊动，带动内脏瞬间下行，使得人体的重量快速下落，传递至打击点上进行攻击的一种方式，又称之“将身体重量挂在手上”攻击，或者称为“球体打人”。充分调动人体重量，同时借助“筋骨”的崩弹，完成若干次连续打击。用“坠意”打“塌劲”，这才是真意，将“手上”的“小功夫”练扎实了，摸哪儿塌哪儿，对方都受不了。打法离不开“中三节”和“千斤坠”，有了这把“坠意”，身法起落纵横如轮如风！</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;拳谱中有提到「将身体的重量挂在手上」进行打击，乍一听，感觉不可思议，当身体所有关节能够盘开，整个身体如同弹簧一般，哪儿都能够发劲，哪儿都能崩弹，此时同样可以在梢节形成阻力，令身体如皮筋般拉伸，配合内脏带动身体的快速下坠，打出一把霸道的梢节劲力！</p>`,
          clickNum: 777,
          createTime: '2020-09-09 09:09:09'
        },
        {
          id: 3,
          username: 'admin',
          title_img: require('@/assets/ebcycl/news03.png'),
          title: '揭秘武术筋骨齐鸣，解读武术-典传筋骨体系',
          intro:
            '导读：揭秘武术筋骨齐鸣，武术圈子流传一个筋骨词汇，叫“筋骨齐鸣”，今天就为大家揭秘武术筋骨齐鸣的奥秘。',
          content: `<h2>1、揭秘武术筋骨齐鸣：武术中筋骨齐鸣词汇</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;武术中的“筋骨齐鸣”是每个练武人都或多或少知道的名词，很多练武人把它奉为武功的必备品，是武功的高境界，是高手的代名词。其实不然，武术中的筋骨齐鸣只是武功练到一定程度的自然而然会出现的一种筋骨反应，在武术当中并不稀奇，只能算是练武人，身体练到位，筋骨的一种基本现象。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;筋骨齐鸣没那么神奇，从名字上即可看出，它是运动时筋骨发出的一种声音，这种声音不是关节与关节碰撞产生的弹响，而是关节与关节连接处的肌腱、韧带、大筋等弹性物质，瞬间崩弹产生的嗡鸣和关节腔音。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;很多人觉得不可思议，其实不然，想想古时候的弓箭就能明白了，很多弓箭的弓弦都是用牛筋制作的，弹性足，弹射出去的时候弦会发出嗡的一声响。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;牛的筋可以，为何人的筋骨，人的筋为什么不可以呢？</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;所以，“筋骨齐鸣”其实就是练武人，练习武功，锤炼身体，强健大筋，然后练武术时瞬间的爆发力带动的出拳、出腿所发出的声音，这是筋骨齐鸣。不是什么玄乎的，所谓武功高手的必备品，武功的高境界，高手的代名词。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;一名训练有素的练武人，通过正确的武术武功训练都能做到。</p>
            <h2>2、揭秘武术筋骨齐鸣：武术中筋骨齐鸣词汇的科学解释</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;因为人体关节位于筋骨的关节囊内，筋骨关节间由白色大筋所链接固定，此物质是具备弹性的，当筋骨关节缝拉伸开，则能将大筋拉开，产生弹力，能够起到辅助筋骨关节弹射发力的效果，使肢体瞬间如弹弓弹射弹珠般击向对方，速度快，劲力透，也是练武人脱胎换骨的缘由所在。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;由于在关节囊内，关节间的突然由开而闭，产生类似针筒突然拔开带动的声音，这就是关节腔音，也就是武术中的筋骨齐鸣。古人懂行的，会教徒弟的，都会用之判断练武的正误，可以隔着房间就能知道徒弟练武，练得对不对。</p>
            <h2>3、揭秘武术筋骨齐鸣：揭秘武术中筋骨齐鸣的常见问题</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;因为现代设备原因，至今还未有能够将筋骨齐鸣声音录得清清楚楚的装备，所以网络视频很多，但能通过视频清晰表达无误的很少，很多人通过视频学习筋骨齐鸣，其本质是不推荐的。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;咱们可以通过视频了解筋骨齐鸣，但切记不能模仿，也不能过度去追求，不然本末倒置，甚至有伤筋骨。武术武功毕竟是练身体的一门技术，而非专门练声音，而不能为了追求“音效”，而放弃正经的练武，这是不明智的。这种心态，还是放弃练武为好。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;一步一个脚印，练武不能好高骛远，想一下练成高手，想一遇机缘，有武功高手传功，一夜功力上涨一甲子，成为武功高手，这是不可能的。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;唯有坚持不懈，揭秘虚幻，揭秘假大空，揭秘好高骛远，今日以揭秘武术筋骨齐鸣为引，希望大家练好武术，野蛮体魄。</p>`,
          clickNum: 888,
          createTime: '2020-08-08 08:08:08'
        },
        {
          id: 4,
          username: 'admin',
          title_img: require('@/assets/ebcycl/news04.gif'),
          title: '武学的至高境界——出手不见形！',
          intro:
            '导读：“出手不见形”是句武林老话了，懂武艺的人差不多都听说过，它代表了武术的极高境界，值得竭力追求，但并不是每个人都能洞悉它的真正内涵。',
          content: `<p>&nbsp;&nbsp;&nbsp;&nbsp;首先，它并不像是有的初学者所想像的那样，指的是动作很快，以至无法见其形，而是指的无形无式，没有定形。它是十足的高手们的术语，并不像某些人一味苦练，或者是光想着巧练的人所想像的那样简单。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;任何艺术的真谛都是必然要返归自然，而这种自然义被人称之为自由王国，它和普通的自然状态相比，又有了质的飞跃，到达自然境界的武术家们，形、意、力已融为一体。正因为有形的自然，所以让人看不出动作有任何征兆，在接近敌人的一瞬间，却能自动构成了最佳“切、和”，似乎字字都不单纯讲招术的要求，字字都和内在的精神、意念有关。达到这种境界的人也许根本不需要再考虑什么“形”的问题，而没有达到的人呢，会认为所谓“虚灵守默，应感无穷”又实在太过玄虚。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;其实，高手们也是有讲招术的时候的，著名的形意拳家郭云深就是用他的“半步崩拳”打遍天下未遇敌手。但他的半步崩拳其实已不是外行们所能理解的“半步崩拳”了，他是融合了他的毕生功力的，只不过是以他自己最喜爱的崩拳体现，使他成为武术家，李小龙天生的素质和刻苦的训练使他达到了很高的高度，几乎难有敌手。但可惜的是，自从他英年早逝后，截拳道却再也没有出现过世界级的高手，甚至不如形意拳之类简单而古老的拳术代代都有高手能雄踞武坛，这似乎可以看出内在的修为胜过了单纯的苦练了。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;事实上，不仅在中国的武术界是这样，国际武坛上，达到一流的格斗家都或多或少要有“意”的体验，比如拳王级的选手发拳时所需的距离只要有3厘米就可以，令人防不胜防；有了意的自然，力与神会，产生了“超速运动”，意到劲也到，“打倒还嫌慢”；力的自然呢，当然不是指创劲或者是巧劲，而是凭借本能产生的“沾劲”发力，故能做到无形无势，挥洒自如，以无形之意，接彼有形之表，拳谱上说的“使日月无光，手到劲发而毫不费力”就是指的这种境界。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;“出手不见形”也是“拳本尢法，有法亦空”的具体解释，可以说是摒弃了人造的方法和固定的招术，向变化无穷，无形无势中探求武术的真谛。那些津津乐道于本门招式的人，如果就此止步，不再进取，是永远也无法明白真正的武术的。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;如何才能达到“出手不见形”呢?那应该不是一个目标，而是一种境界。武术家王芗斋称之为“拳拳服膺”，他对大成拳的最深体验为五字真诀“恭、慎、意、形、式“所表现出来罢了。他本可能用其它的外在形式打败对手，就如一个少年能用任何的动作打败比他弱小的儿童一样。郭云深的武术代表了他那时代的最高水平，有意露形，并非武功不济，而是象征了高中之高的境界啊。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;现代武术家李小龙直到在逝世之前的几个星期，才指出了人不是靠技术，而是靠本能才能进行真正的搏斗的。但是，到底要如何才能练出他所想像的神奇的本能，他本人并没有能够谈到和来不及去实践，而是全靠了超过常人负荷的训练才取得成功的。在他武术生涯的晚期，他曾经试图希望通过气功入静来达到高度的放松肌肉的能力，来达到他希望的本能。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;事实上，他所创立的截拳道其实只是一种简化了的、以格斗为主要宗旨的拳术，比传统的武技更加简洁和实用，技术干净利落，训练手可以将对手击倒，这在实战中差不多是等于不需距离，与中国武术中“沾劲”发力极为相似。难以想像，没有精神和体能的高度配合，单凭蛮力怎能达到如此的境界。难怪李小龙这样认为：只要有人真的学会了他的寸拳绝技，就可能将他击败。是不是他已经领悟到了武术中的另一种境界：不是以拳和人搏斗，而是用心击败对手？</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;号称“五百年来无敌手”的泰拳是把假想敌练习作为实现“蓄、闪、遮、格”战术原则的高级手段，日本柔道中最重要的原理是“心气力合一”，剑道中叫作“气剑体合一”。古代日本高手大波就是采用了类似中国武术中立禅一样的训练，而产生了武术上的质的飞跃，成为日本第一高手。他们的方法与中国历代武林如少林、形意、太极高手的方法居然不谋而合。这是不是说明了任何艺术，无论是其外在形式如何，都必须遵循内在的共同规律呢？ </p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;总之，只有外形的训练而没有达到内炼的境界，难以实现我们所要求的“出手不见形”，甚至可以这样说，内在精神系统的训练才是武术区别于其它体育项目锻炼的根本标志，也是武术之魂。</p>`,
          clickNum: 999,
          createTime: '2021-01-10 12:11:10'
        },
        {
          id: 5,
          username: 'admin',
          title_img: require('@/assets/ebcycl/news05.jpg'),
          title: '太极拳，真正的“运动之王”',
          intro:
            '导读：大家都知道太极拳有良好的养生保健功效，同其他体育项目一样，只有经过长期的锻炼才能发挥出来，贵在坚持练习。每位立志习练太极拳进行养生保健者，都应从中悟出持之以恒的道理。',
          content: `<h2>太极拳是一种“全身运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;太极拳动作比较全面，上下相随，周身“一动无有不动”，全身各大肌群和关节都能参与运动，长期习练可以使关节灵活，肌肉结实有力。</p>
            <h2>太极拳是一种“平衡运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;太极拳动作舒展流畅，连绵不断，而且特别强调虚实转换，经常习练太极拳，有助于提高周身动作的协调性和平衡性。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;近年来，国内外一些研究机构通过实验，证实太极拳可以改善或提高人体活动平衡性的素质，减少老年人跌倒的发生。</p>
            <h2>太极拳是一种“休闲运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;打太极拳时要求静、慢、匀、柔、松、稳、合、连、圆、轻等，意识集中，全神贯注，全身放松，动中求静，心静用意，养气凝神，给大脑以休息;</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;动作上轻灵柔和，情绪上安定乐观，性命双修，陶冶情操;外练骨骼、关节、肌肉，内练五脏六腑，是理想的“松弛运动”。</p>
            <h2>太极拳是一种“调心运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;打太极拳时，要求全神贯注，用意不用力，用意识引导动作，意识与动作融为一体，要领会和体现出动作形象所包含的神韵。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;因此，打太极拳可以训练注意力，使精神从急躁、浮躁、散乱之中解脱出来，转变为耐心、凝聚、凝神、专心，对于防治现代文明病具有积极作用。</p>
            <h2>太极拳是一种“调息运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;太极拳又称内家拳，集养生学、中医学、健身气功学、仿生学于一体，运用吐纳术和导引术，以意运气，以气运身，气力合一，使“调身、调息、调心”的有机相融，实现祛病健身、延年益寿的目标。</p>
            <h2>太极拳是一种“健腰运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;太极拳的全身运动以腰为轴，躯干转动带动全身联转。根据中医的理论，有助于锻炼命门，畅通督脉，充实肾气。肾气旺盛，命门火足，则人精力充沛，面有光泽，两眼有神。</p>
            <h2>太极拳是一种“温和运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;太极拳动作温柔、缓慢，经试验证明相当于每小时步行6公里的运动强度，特别适宜于中老年人锻炼。</p>
            <h2>太极拳是一种“有氧运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;特点是强度低、有节奏、非竞争、可控性强，持续时间长，运动过程中不致缺氧，不损伤人体脏器，适宜减肥，并且方便易行，安全可行，容易坚持。</p>
            <h2>太极拳是一种“不受限的养生运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;它不受年龄、性别、体质、场地、时间、器材以及其他物质条件等限制。 基于太极拳的这些特点与优势，在众多的健身运动中堪称为上佳的全民健身运动。</p>
            <h2>太极拳是一种“搏击运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;借力打力，四两拨千斤，静以待动，后发先至，以弱胜强……这些都是太极拳的技击特点，也表明太极拳是一种高阶武术。</p>
            <h2>太极是一种“哲学运动”</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;一阴一阳之谓道。太极拳一招一式皆不出阴阳哲理。我们在感受人体的阴阳对立统一时，收获的不仅是拳，更是奥妙无穷的太极哲学。修练太极，在外是变化气质，在内是修身立命。如此性命双修，世所罕见！</p>`,
          clickNum: 789,
          createTime: '2021-02-02 20:20:20'
        }
      ],
      currEbcycl: {}
    }
  },
  computed: {},
  watch: {},
  created() {},
  mounted() {},
  methods: {
    // 预览
    previewEbcycl(Ebcycl) {
      this.currEbcycl = Ebcycl
      this.$nextTick(() => {
        this.$refs.EbcyclPreview.open()
      })
    }
  }
}
</script>

<style scoped lang="less">
.ebcyclopedia-container {
  .header {
    display: flex;
    justify-content: space-between;
    align-items: center;
    height: 70px;
    .el-link {
      font-size: 20px;
    }
  }
  .news {
    .news-list {
      display: flex;
      height: 180px;
      margin-bottom: 20px;
      background-color: #fff;
      .el-image {
        width: 220px;
        height: 160px;
        margin: 10px;
      }
      h3 {
        font-size: 18px;
        margin: 10px;
      }
      p {
        color: rgb(228, 85, 20);
        width: 700px;
        font-size: 16px;
        margin: 10px;
        display: -webkit-box;
        -webkit-box-orient: vertical;
        -webkit-line-clamp: 4;
        overflow: hidden;
      }

      .news-footer {
        display: flex;
        justify-content: space-between;
        padding: 0 10px;
        span {
          font-size: 15px;
        }
      }
    }
  }
}
</style>
