// 功法秘籍组件
<template>
  <div class="esoterica-container">
    <esoter-item :esotericaData="esotericaData1" />
    <esoter-item :esotericaData="esotericaData2" />
  </div>
</template>

<script>
// 功法秘籍组件
import EsoterItem from './components/esoter-item'
export default {
  name: 'esotericaIndex',
  components: {
    EsoterItem
  },
  props: {},
  data() {
    return {
      esotericaData1: {
        esoterName: '少林派',
        img1: require('@/assets/esoter/shaolin-h.jpg'),
        esotericaList: [
          {
            id: 1,
            username: 'admin',
            title_img: require('@/assets/esoter/shaolin01.jpg'),
            title: '少林罗汉拳 （少林七十二绝技之一）',
            click_num: 121,
            create_time: '2020-10-10 10:10:10',
            content: `<h2>少林罗汉拳。为少林寺代表性拳术之一。</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;其实罗汉拳按其本意来，分为强身健体的十八罗汉手、与后来演变为了格斗的罗汉拳。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;它的主要特点以技击为主，结构严谨，功架规整，古朴大方，动作式式连贯。讲究；出手上中下，里外分阴阳；以上破下，以下破上；指右打左，声东击西；虚实不定，快速多变。要求气发吹齿，发声如雷，晃身晃膀，扭腰调胯，崩抖发力，以声助威，以气促力</p>
            <h2>训练技巧</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;少林门人供奉释迦牟尼，并视此拳取十八罗汉之姿，故称罗汉拳。主要手法有隔、迫、冲、闪、点、举、压、钩、抄、抛。腿法讲究腾、滚、扫、弹。罗汉拳要求上下相随，步随手变，身如舵摆，灵活多变，出手注意“夺中”和“护中”，劲力要求刚柔相济。拳谚讲：“要想罗汉好，三正里面找。”所谓“三正”，是指的手要正，身要正，马（即步）要正，这是基础功夫。练好“三正”，才能保持稳定，罗汉拳中较大的套路有“六十八式罗汉”和“一百零八工罗汉”等</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 2,
            username: 'admin',
            title_img: require('@/assets/esoter/shaolin02.jpg'),
            title:
              '七星拳是汉族优秀的武术拳种之一，原是少林七星门的看家拳，也是少林武术的基础之一，与长护心意门同属小架拳类，素有子母拳之称，七星拳短小精悍，灵活多变，且有拳打卧牛之地的特点。',
            click_num: 112,
            create_time: '2020-10-12 11:11:11',
            content: `<h2>简介</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;七星拳是历史悠久，内容丰富，风格独特，流传广泛，是一个优秀的汉族传统拳种。现今少林寺地区流传最广的套路。它练起来动如猫，行如虎，参照天下北斗土星定位，动作架势以它独有步型、步法而组成。步型要求两脚前后站在一条线上并齐，称为小缩身，这个动作也是考验少林武师在练习少林拳时的功夫深浅的标准。其动作大开大合，气势逼人，则有迅雷不及掩耳之势。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;该拳的风格特点是：手法凌厉，腿法多变神奇、身法自然巧妙，功架大开大合、舒展大方，手、眼、身法、步、精、气、神、内功浑然一体，犹如楚霸王临阵，其势雄猛。</p>
            <h2>特点</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;有歌诀：少林七星拳，掌行袭五瓣。招式技法奇，也走一条线。亦有十字路，四方应其变。花爪制人妙，鸡行步法连。纵横连八法，千阵破万关。上中下地锤，躺脚扫百川。更有金骨肘，亦可冲破天。遇强束身溜，鹞子巧翻山。灵机施地炮，飞脚如电闪。崩挑推神掌，天中隐有天。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;该拳的风格特点是：手法凌厉，腿法多变神奇、身法自然巧妙，功架大开大合、舒展大方，手、眼、身法、步、精、气、神、内功浑然一体，犹如楚霸王临阵，其势雄猛。</p>
            <h2>练法</h2>
            <h3>起势</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;动作要领：两腿并步站立，两手成钳子手，置大腿两侧，抬头、挺胸、收腹。</p>
            <h3>1.钳子手</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;动作要领：两腿并拢屈膝成半蹲步，左手护耳部，右手护膝部，目视前方。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;易犯错误：两腿屈膝下蹲，膝间空隙过大。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;纠正方法：两腿屈膝并拢。</p>
            <h3>2.弓步冲拳</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;动作要领：两腿成右弓步，左拳前冲拳，右拳抱至腰间，目视前方。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;易犯错误：抱拳不到位。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;纠正方法：右臂屈肘，右拳抱至腰间。</p>
            <h3>3.回身崩拳</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;动作要领：两腿屈膝成马步，左拳抱至腰间，右拳护住膝盖，目视前方。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;易犯错误：马步过高。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;纠正方法：马步时两腿成水平，挺胸、抬头。</p>
            <h3>4.三崩手</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;动作要领：两腿成半蹲步，再上步变成马步，右拳护膝，重心前移，再屈肘前顶，成弓步扳手。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;易犯错误：上下肢动作不清楚。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;纠正方法：上下肢动作要协调一致。</p>
            <h3>5.缩身钳子手</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;动作要领：两腿弹击时与手同时出击，两腿呈半蹲状，右手护耳部，左手护膝部 ，目视前方。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;易犯错误：弹腿不直，力点不准。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;纠正方法：弹腿时脚尖绷直。</p>
            <h3>6.鸡形步</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;动作要领：左脚击右脚，转身成半站立步，右脚在前，重心在后，目视前方。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;易犯错误：半站立步不准确，身体前倾。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;纠正方法：抬头、挺胸、收腹，两腿站稳。</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 3,
            username: 'admin',
            title_img: require('@/assets/esoter/shaolin03.jpg'),
            title:
              '少林小洪拳属于武术中少林拳术的基本拳技套路，是初学少林拳术的必修套路，素有“十八拳之母”之说。',
            click_num: 163,
            create_time: '2019-09-09 09:09:09',
            content: `<h2>基本介绍</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;小洪拳的步型有并步、弓步、马步、蹲步、虚步等，基本上安排了各家拳术的常见步型；手型有掌、拳五花抓；手法有推掌、抢手、扳手、砍手、掠手、拦手、撩手、抓苗头手；拳种有冲拳、劈拳、撩拳、砸拳、侧拳等;足法有踩脚、泼脚、勾脚；腿法有踢、弹、跳；身法有转身、缩身等；眼法有盯、迷、暴、瞪等，构成了完整的手、足、身、眼、步法，形成了一套系统的理法合一的攻防技术。</p>
            <h2>特点</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;其形姿小巧玲珑，节奏严紧，技法刚健有力，朴实无花架，招含攻防，动作实战，自始至终行在一线，突出了少林拳术的全部特点。</p>
            <h2>拳谱</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;脚立八字，两手下垂，怀中抱月，白云盖顶，上步一掌，抱拳缩身，抬步一掌，转面扳手，上步一掌，转面绷腿，上步双拍脚，斜行，猿猴缩身，上步劈腿，斜行、掠手、狮子大张口，云项出捶，去顶七星，拉开单鞭，抱拳缩身，带步抢手，旋风脚，冲天炮蝎子尾，狮子大张口，后腿两步，转面扳手，上步一掌，转面绷腿，单脚，盘肘，猿猴缩身，上步单脚盘肘，掠手，云顶出捶，云顶七星，拉开单鞭，上步抡手，上步脚，转身六掌，饿虎扑食，肚底炮，上步阳拳，侧耳炮，满肚疼，滚手缩身，抬步一掌，半个云顶，平心炮，左劈山，右劈山，五花坐山。</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 4,
            username: 'admin',
            title_img: require('@/assets/esoter/shaolin04.jpg'),
            title:
              '少林龙拳是传统拳术中象形拳的一种。属于嵩山少林寺传世之“龙、虎、豹、蛇、鹤”五拳之一。',
            click_num: 126,
            create_time: '2020-10-10 10:10:10',
            content: `<p>&nbsp;&nbsp;&nbsp;&nbsp;少林龙拳是传统拳术中象形拳的一种。属于嵩山少林寺传世之“龙、虎、豹、蛇、鹤”五拳之一。相传为金元时期少林寺僧人秋月禅师所创。相形拳多见于鸡，燕，马，牛，虎，兔，蛇，龙。龙在人们的印象中灵活多变，远近皆易，隐而忽现在无形中变化；无定法即为法，此拳体现了禅宗的法无定法，禅入武式，突出了武术的特色。</p>
            <h2>简介</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;据《少林寺志》、《少林拳术图说》、《少林内功五形拳》等资料载，秋月禅师俗名白玉峰，山西太原人，大约生活在金元时期。他家境殷实富裕，自幼喜练武功。凡有过路侠客，有一技之长者，必请至家中，敬养求教。后又到处访师学艺，终有大成，名动四方。但这时的白玉峰也因学武把家财耗尽，于是就四海为家，以授徒传武为业。白玉峰尤精通气功，擅长剑术。他身躯虽然不大，年过五十后却仍健壮非常，精锐之气逼人。</p>
            <h2>历史沿革</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;当时嵩山少林寺觉远和尚经师父桓温法师同意后离寺云游，欲访天下武技高手，切磋讨教，以完善、发扬少林武功。觉远和尚在兰州遇到了武功高手李叟、两人切磋数日后，李叟向觉远和尚推荐了他的朋友白玉峰。两人同去洛阳，找到了正在那里逗留的白玉峰。然后觉远和尚、白玉峰、李叟父子四人回到嵩山少林寺。四人在寺里交流所学，切磋印证。尤其是白玉峰，毫不保留地把自己一生所学传给觉远和尚及其他寺僧。白玉峰并且同觉远和尚一道对少林寺所演练的数百个拳械套路进行了系统整理。觉远和尚把少林寺镇寺之宝罗汉十八手由原来的十八手发展到七十二手，再增加到一百七十三手，这才有了后来名动天下的少林寺十八路罗汉拳。白玉峰则在觉远和尚的协助下，结合自己的习武心得，撰写了《五拳精要》一书。白玉峰认为，人之一身、精、力、气、骨、神五者，必须交互修练、武功始可臻上乘神化之境。为此，他创立了五拳，并指出“龙拳练神，虎拳练骨，豹拳练力，蛇拳练气，鹤拳练精”，系统地阐述了少林龙、虎、豹、蛇、鹤五拳的不同特点及练法。白玉峰后来皈依少林寺为僧，法号秋月。少林寺后世僧人为纪念觉远和秋月二僧中兴少林武技的功劳，分别尊称二人为“觉远上人”、“秋月禅师”。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;据流传下来的有关资料看，秋月禅师所创的龙拳，招法简朴，注重调息内练，真正体现了“龙拳练神”的特点，当然，这可能和秋月禅师精通气功有功。</p>
            <h2>发展现状</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;2017年在嵩山少林寺及其附近流传的龙拳共有三路，其中第一路保留了龙拳的原始特点，重在练神，演练时要与调息、运气相结合，其它二路则是后世少林弟子对原始龙拳的推演，虽不再注重练神，却也体现出少林拳法质朴刚健、快捷有力、攻防合理、注重实战的特点。</p>
            <h2>第三路</h2>
            <h3>练习歌诀</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;二路龙拳少林传，僧俗推研数百年。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;怀中抱月蓄气势，拦腰横掌把敌砍。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;双关铁门防后敌，盯心标拳惊人胆。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;横掌拦腰接着用，黑虎掏心仍相连。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;后退一步拳下栽，右捶再击敌心肝。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;马步冲拳扬我威，弓步摆击招法仙。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;右推一掌山峦倒，掌刀双插铁肚穿。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;上架下按坐山势，虚步下栽双腿间。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;照心双插又使用，罗王御敌来坐山。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;鹞子翻身左掌切，单峰贯耳击敌脸。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;破敌之用拦腹掌，右肘横击心也寒。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;回身顶肘击后敌，马步按掌内气满。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;右脚上前双分膝，左腿后收再栽拳。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;右左砸拳霹雳势，大鹏展翅欲冲天。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;右左砸拳再次用，右左护膝保平安。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;三十六招演练完，嵩山少林寺美名传。</p>
            <h3>动作名称</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;怀中抱月，拦腰掌，双关铁门，盯心标拳，拦腰拳，掏心拳，虚步栽拳，掏心拳，马步压肘，掏心拳，马步冲拳，弓步摆拳，右推掌，插心掌，插心掌，坐山势，虚步栽拳，插心掌，插心掌，坐山势，鹞子翻身，单峰贯耳，拦腰掌，盘肘，顶肘，马步按掌，马步按掌，双分膝，虚步栽拳，右砸拳，左砸拳，大鹏展翅，右砸拳，左砸拳，右护膝，左护膝。</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 5,
            username: 'admin',
            title_img: require('@/assets/esoter/shaolin05.jpg'),
            title: '少林棍法之 （少林三十六棍）',
            click_num: 96,
            create_time: '2020-03-10 16:52:10',
            content: `<h2>棍扫千秋，百兵之母——少林棍</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;棍术是武术器械练法的一种，棍术演练用起来都离不开劈、崩、缠绕、点、拨、拦、封、撩、扫等棍法，其形式有单人练、集体练等。在演练时要手臂圆热，身棍合一，力透棍尖，风声呼啸，要求勇猛快速有力。双手执棍开合，旋转时要圆熟自如，舞棍时要求手、眼、身、法、步协调合一，有利于提高身体的力量速度、耐力、培养勇敢顽强的精神。</p>
            <h2>按掌起势</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;01、隔棍盖把 02、绞棍推挡 03、戳把刺棍</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;04、仆步劈棍 05、翻身劈棍 06、丁步立棍</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;10、独立云崩 11、震脚戳把 12、跪步崩棍</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;07、弓步推挡 08、盖步点棍 09、跳步平抡</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;13、弓步盖把 14、挂把盖地 15、侧踹盖把</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;16、弓步挑把 17、舞花翻劈 18、弓步摔棍</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;19、撩蹬戳把 20、换步点棍 21、撤步撩棍</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;22、舞花提点 23、仆步劈棍 24、弓步崩棍</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;25、转体扫棍 26、仆步背棍 27、左右平抡</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;28、拉棍坐盘 29、划地扫腿 30、提膝挑把</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;31、绞棍压把 32、丁步担棍 33、马步扛棍</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;34、跳步劈棍 35、挂把推挡 36、退步搅棍</p>
            <h2>按掌收势</h2>
            `,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 6,
            username: 'admin',
            title_img: require('@/assets/esoter/shaolin06.jpg'),
            title:
              '棍是中国武术长器械的一种。齐眉棍子立棍于地，棍高以眉齐为度，舞动时可大蹦大跳，倭、劈、归、舞灵活多变，棍声呼啸，气势极为勇猛。',
            click_num: 88,
            create_time: '2020-06-23 15:16:24',
            content: `<h2>内容简介</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;少林齐眉棍据《少林棍谱》记载：齐眉棍是明代少林寺南院和尚超水大师所创编，原有四十八势，传到清代，经湛举和尚及门徒寂袍等共同增编至五十二势，流传至今。1．歌诀齐眉棍源永化堂，水公赐技十六棒。招招降魔除恶邪，声声劈打尘飞扬。授予禅门世子孙，演技更新换新样。游卧劈砸刺拨拦，压格架跳踢翻挡。苦练齐眉一根棍，亦为少林添荣光。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;少林棍法中最负盛名的奠过于齐眉棍了。齐眉棍因“立棍于地，棍高与眉齐”而得名，它长短粗细适中，在舞动时，既可以反转腾挪，倭、劈、归、舞，灵活多变，棍声呼啸、气势恢宏，练起来横扫千军、棍打一片、威力无穷。从基础棍法到秘传绝技，全程示范。图文结合，招式功法详细分析，武功心得细致点拨。基本握棍之法，7大基础棍法，6大基本步法，31招正宗少林齐眉棍武艺，完整套路、一气呵成、刚劲勇猛、超强爆发。</p>
            <h2>少林齐眉棍棍法绝技</h2>
            <h3>第一段</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;
起势
马步立掌
金鸡独立
弓步推掌
上右步撩棍
上左步撩棍
盖棍
仆步劈棍
愚公移山
上步劈棍
回头望月</p>
<h3>第二段</h3>
<p>&nbsp;&nbsp;&nbsp;&nbsp;虚步架棍
弹腿
转身横扫
转身上步横扫
震脚后踹
上步架棍
回头望月
上步侧空翻
盖棍
立扫千钧</p>
<h3>第三段</h3>
<p>&nbsp;&nbsp;&nbsp;&nbsp;隔挡盖棍
仙人指路
跳步戳棍
虚步收棍
秋风扫落叶
转身扫棍
弹棍上步戳棍
立劈华山
五花坐山
收势</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 7,
            username: 'admin',
            title_img: require('@/assets/esoter/shaolin07.jpg'),
            title: '少林卧龙刀出自少林，有刀法别致，注重技击，步快手疾的特点',
            click_num: 86,
            create_time: '2020-06-06 16:16:16',
            content: `<h2>少林卧龙刀又被称为“诸艺之胆”。它的主要特点；刀法别致，注重技击，步快手疾，劲整势猛，身械合一。演练起来讲究；大劈大砍，跳跃轻灵，翻腾旋转，出奇制胜，同时节奏鲜明，显示了出刀如猛虎的雄健剽悍之刀术风格。</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;其实罗汉拳按其本意来，分为强身健体的十八罗汉手、与后来演变为了格斗的罗汉拳。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;它的主要特点以技击为主，结构严谨，功架规整，古朴大方，动作式式连贯。讲究；出手上中下，里外分阴阳；以上破下，以下破上；指右打左，声东击西；虚实不定，快速多变。要求气发吹齿，发声如雷，晃身晃膀，扭腰调胯，崩抖发力，以声助威，以气促力</p>
            <h2>训练技巧</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;少林门人供奉释迦牟尼，并视此拳取十八罗汉之姿，故称罗汉拳。主要手法有隔、迫、冲、闪、点、举、压、钩、抄、抛。腿法讲究腾、滚、扫、弹。罗汉拳要求上下相随，步随手变，身如舵摆，灵活多变，出手注意“夺中”和“护中”，劲力要求刚柔相济。拳谚讲：“要想罗汉好，三正里面找。”所谓“三正”，是指的手要正，身要正，马（即步）要正，这是基础功夫。练好“三正”，才能保持稳定，罗汉拳中较大的套路有“六十八式罗汉”和“一百零八工罗汉”等</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 8,
            username: 'admin',
            title_img: require('@/assets/esoter/shaolin08.jpg'),
            title: '少林罗汉拳 （少林七十二绝技之一）',
            click_num: 211,
            create_time: '2020-12-12 12:12:12',
            content: `<h2>少林罗汉拳。为少林寺代表性拳术之一。</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;其实罗汉拳按其本意来，分为强身健体的十八罗汉手、与后来演变为了格斗的罗汉拳。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;它的主要特点以技击为主，结构严谨，功架规整，古朴大方，动作式式连贯。讲究；出手上中下，里外分阴阳；以上破下，以下破上；指右打左，声东击西；虚实不定，快速多变。要求气发吹齿，发声如雷，晃身晃膀，扭腰调胯，崩抖发力，以声助威，以气促力</p>
            <h2>训练技巧</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;少林门人供奉释迦牟尼，并视此拳取十八罗汉之姿，故称罗汉拳。主要手法有隔、迫、冲、闪、点、举、压、钩、抄、抛。腿法讲究腾、滚、扫、弹。罗汉拳要求上下相随，步随手变，身如舵摆，灵活多变，出手注意“夺中”和“护中”，劲力要求刚柔相济。拳谚讲：“要想罗汉好，三正里面找。”所谓“三正”，是指的手要正，身要正，马（即步）要正，这是基础功夫。练好“三正”，才能保持稳定，罗汉拳中较大的套路有“六十八式罗汉”和“一百零八工罗汉”等</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          }
        ]
      },
      esotericaData2: {
        esoterName: '武当派',
        img1: require('@/assets/esoter/wudang-h.jpg'),
        esotericaList: [
          {
            id: 1,
            username: 'admin',
            title_img: require('@/assets/esoter/wudang01.jpg'),
            title: '武当太极拳之---三丰太极拳',
            click_num: 111,
            create_time: '2020-03-10 09:24:33',
            content: `<h2>三丰太极拳</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;是第二代太极拳法，有108式。相传乃为三丰祖师门下弟子,根据十三势演化而来，虽五步八法，功防精要，五脏八脉，养身特点，没有明显表现，但尽含其中。其它动作特点
要领，内修功法，练习要求，尽与十三势相同。三丰太极拳，亦能通经活络，益寿延年，历为门下弟子普修之法。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;又称张三丰原式太极拳，传为武当丹士张三丰所创。该拳架古老补实，易学易练，具有形态自然，正直平稳，闪躲圆滑，动作柔和的特点。
该拳尚具有矮裆，变化多的特点。矮裆，则使下盘稳实，有利于内气下沉，腿部肌肉得以充分运动，具有很好的健身和技击价值</p>
            <h2>功法名称：</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;1、太极起式
2、提手上式
3、左向挤手
4、右向挤手
5、揽雀尾
6、手挥琵琶
7、提手上势
8、搂膝拗步
9、揽雀尾
10、搂膝拗步
11、揽雀尾
12、搂膝拗步
13、揽雀尾
14、进步搬拦锤
15、如封似闭
16、提手上势
17、搂膝拗步
18、抱虎归山
19、肘底看锤
20、倒撵猴
21、斜飞
22、手挥琵琶
23、提手上势
24、海底针
25、撤步赛通臂
26、斜飞
27、白鹤亮翅
28、云手
29、高探马
30、转身左右分脚
31、搂膝拗步
32、搂膝栽锤
33、翻身撇身锤
34、披向踢脚
35、翻身二起脚
36、转身蹬脚
37、弯弓射虎
38、上步挤手
39、搂膝拗步
40、揽雀尾
41、退步搬拦锤
42、如封似闭
43、双风贯耳
44、野马分鬃
45、玉女穿梭
46、单鞭下势
47、白鹤亮翅
48、云手
49、金鸟独立
50、倒撵猴
51、斜飞
52、手挥琵琶
53、提手上势
54、海底针
55、退步赛通臂
56、斜飞
57、白鹤亮翅
58、云手
59、上右步压肘
60、上左步压肘
61、腋下掌
62、十字摆莲
63、弯弓射虎
64、上步挤手
65、上步七星
66、上步跨虎
67、转身摆莲
68、弯弓射虎
69、上步挤手
70、手挥琵琶
71、合太极
72、太极收势
73、鹰勾拳</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 2,
            username: 'admin',
            title_img: require('@/assets/esoter/wudang02.jpg'),
            title: '武当太极拳之---两仪拳',
            click_num: 56,
            create_time: '2020-10-25 15:11:10',
            content: `<h2>两仪拳</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;又称玄武拳，用来练习手、眼、身、法、步、及混元劲(暴发力、反弹力)的一种拳术。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;其风格是：快慢相兼，刚柔相成，有行如龙，坐如虎，闪如电，发如雷的武术特点，有后发先制的实战效果，是太极门中的必练长拳。道曰：“阴阳和合为太极，分开曰俩仪”此拳或快或慢，或刚或柔，阴阳各见所长，故曰“两仪”。两仪拳法有：武当玄武拳、龙华拳、伏虎拳</p>
            `,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 3,
            username: 'admin',
            title_img: require('@/assets/esoter/wudang03.jpg'),
            title: '武当太极拳之---太极十三势',
            click_num: 66,
            create_time: '2020-09-03 20:18:19',
            content: `<h2>太极十三势</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;是第一代内家拳，为三丰祖师所创，十三势是由起势、抱球势、单推势、探势、托势、扑势、担势、分势、云势、化势、双推势、下势、收势等攻防意识较强的十三组动作组成，其中内含吐纳导引、采补混元桩等三种道家内修养身功法，然十三势动作亦是根据锻炼人体八脉的需要所编，而八脉又内连五脏，整个套路内含五脏八脉，外有五步八法，兼之功防十三组合，容合道家养身丹术，故谓“太极十三势”。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;其动作要领是：虚灵顶颈，含胸拨背，沉肩坠肘，舌顶上腭。练习时要求形与意合，意与气合，气与神合，六合之中，神形具妙，动作之中，绵绵不断，如行云流，松沉自然；动静之中如绵里藏针，刚中带柔，柔中有刚，刚柔相含，含而不露；呼吸之中，开合自如，升降自然，深细长匀，息息归根。太极十三势内含丰富，意义深远，自古为武当镇山之宝，秘传之法。</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 4,
            username: 'admin',
            title_img: require('@/assets/esoter/wudang04.jpg'),
            title:
              '武当八卦掌是一种把攻防招术和导引方法融合于绕圆走转之中的拳术。原名"转掌"， 后称"八卦掌"、也称"八卦转掌"、"游身八卦掌"、"阴阳八卦掌"、"八卦连环掌"等。',
            click_num: 123,
            create_time: '2020-06-19 11:35:56',
            content: `<h2>掌法简介</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;后世传习者多以转掌的走圈似循八个方位的连线。其技法讲究纵横交错、随走随变；其击法讲究临机应变，以变应变，合于〈周易〉中"刚柔相摩、八卦相荡"，运动不息、变化不止之理，而惯称为八卦掌。关于此掌的起源，传说不一，一说为武当张三丰所创，后董海川经一道人习得。另一说为清咸同时河北文安朱家务、董海川所创。此掌系以极似道教"转天尊"的绕圆走圈导引术和武术攻防方法融合成基本运动形式，采用"易理"论述拳术运动规律，形成"以动为本、以变为法"的基本拳理。武当八卦掌以站桩和行步为基本功，以绕圆走圈为基本运动形式。走转的足迹路线分为走阴阳鱼、走八卦图、走九宫等，它充分发挥掌比拳和勾长的优势，以掌代拳施捶打之能，以掌代勾行拔掳之巧，形成了该掌系手法几乎全是掌法的特点。八卦掌不仅是一门技击术，也是一门健身术。据研究表明，经常练习武当八卦掌，能改善自体系统的机能，取得健身延年的效益。武当八卦掌是道教武功之结晶
1、单换掌 2、双换掌
3、托天掌 4、转身掌
5、顺势掌 6、磨盘掌
7、下势掌 8、双穿掌</p>
            
            <h2>功法特点</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;武当八卦掌的起源是根据道祖炼丹转丹炉行火候之需要，结合易理及武术攻防的特点创生。经世代先暂探索总结，一立在道内传播。大约于清逆光中叶，始外传民间。</p>
            <h3>内外合一</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;演练武当八卦掌，要内外合一，形意兼备，动静相合，走如游龙，静若石猴，盘旋似鹰，坐如虎踞。也就是说，八卦掌要求身手矫健、神态机敏、走观坐翻转、手眼身法步、心神意念合为一身。做到身随步走，步随掌换，掌随身变，手眼相合。步法稳沉轻盈，行如流水，身法灵活柔韧，似水中蛟龙。要以腰为轴，讲求周身旋转，劲力完整，掌法敏捷遒劲，上中下三盘连贯一气，内外相合。集走、转、拧、翻、穿、搬、截、拦、推、托、带、领、缠、扣、刁、钻而浑然一体。</p>
            <h3>八卦掌强调走</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;即自始至终连绵不断，势势相连，行如流水，气若车轮，毫不停滞。步法走圈，手法运圈，身法化圃，周身内外无处不生环。它是以掌代拳，以旋转走圈为主，变化莫测，收放参用，摆扣变换急如风电；又有步法轻盈，腰腿敏捷，掌分阴阳上下翻飞，垂用坠肘，气沉丹田，久而久之气遍全躯，进退自如，动静归根，攻守得当的特点。八卦掌以中枢为正，腰步为根，以步助腰，以腰助肩，以肩助肘掌，因而腰带动身躯，则步法轻盈，身法灵活。</p>
            <h3>柔中含刚 刚柔相济</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;卦掌乃柔中含刚，刚柔相济之拳术。在力学上，生理和养生上，技击都有相当的哲理性。故研究此道者，须经过一定的程序，漫长的时日。虽有明师传导，问道好友的切磋，但最主要的是在师傅的真传下，掌握正确的练法，得到内功真传。同时还需自身刻苦锻炼，否则只顾终门谈论，思暮经年，一朝伸手，则空洞无物，依然是门外汉。所谓“终思无益，不如学也”。若能晨昏无间，寒暑不易，一经动念即举手历练，无论男女老少都可成功。
武术之道，门类甚多，就其体用而言，无非内外(软硬轻重)刚柔之功。</p>
<h3>讲求内练真气</h3>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;武当八卦掌系内家拳，讲求内练真气，外练刚柔相济，以静制动养生延年。要想学好八卦掌，必须把基础打牢。祖师曰：“三年一小成，六年一中成，九年一大成”。初练时，必须在走囤上下功夫，方能人得门来。八卦掌是武当拳之上乘功夫，必须练好内功。那么内功如何练?要靠真师真传。“八卦”是由无极而起，太极而运，两翼而出，脚踏八方，游移夺魁，全在于习练者用心研修，掌握方法方能得道。
以混元功为内功，定式为练正。“老八掌”为练形。“六十掌”为应用。练九宫可延寿命，练剑术可使神清。</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 5,
            username: 'admin',
            title_img: require('@/assets/esoter/wudang05.jpg'),
            title:
              '武当剑以走、变、快、灵为特点，素有“太极腰，八卦步”的赞誉，是我国著名的剑术套路',
            click_num: 156,
            create_time: '2020-05-16 16:26:33',
            content: `<h2>武当太极剑是我国太极名家李德印老先生在传统太极剑和武当剑的基础上，融化改编的剑术套路。</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;它既有太极剑轻松柔和、绵绵不断、意领身随的特点，又有武当剑优美潇洒、灵活多变、身剑合一的特色。练起来行如游龙，稳如山岳，动静相间，有刚有柔，气势连贯，错落有序。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;武当太极剑以柔克刚，以静制动，后发先制，四两拔千斤的武术特点，并有练精化气，练气化神，练神还虚，还虚合道的道教气功功法，又有强身健体，防身自卫，发人体能延年益寿的特点，是集武术与养身为一体的剑法，演练太极剑要求虚领顶劲，含胸拔背，沉肩坠肘，动作舒展要求内含其气，外含其形，动静结合，神气相含，其动作特点行如流水连绵不断，不动则不动，一动全身动的风格。</p>
            <h2>剑法</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;主要剑法包括：劈、刺、点、崩、撩、带、抹、拦、击、挂、托、穿、抽等。其特点是：剑法清澈，动作柔缓；节奏平和，柔漫舒展；身神剑合，气势饱满。</p>
            <h2>剑谱</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;1、起势 2、丁步点剑3、回身点剑
4、仆步横扫 5、右左平带 6、分脚领剑
7、叉步反撩 8、马步云抱 9、丁步截剑
10、翻身崩剑 11、弓步下刺 12、独立上刺
13、仆步穿剑 14、蹬脚前刺 15、跳步平刺
16、转身平刺 17、行步穿剑18、行步扣剑
19、弓步下刺 20、腾空跳刺 21、马步藏剑
22、回身反刺 23、虚步崩剑 24、独立上刺
25、撤步平斩 26、仰身架剑 27、转身回抽
28、并步平刺 29、行步撩剑 30、仰身撩剑
31、盖步按剑 32、跳步下刺 33、歇步压剑
34、虚步点剑 35、独立托架 36、弓步挂劈
37、歇步后刺 38、叉步平斩 39、虎步抱剑
40、叉步平带 41、弓步反崩 42、提膝点剑
43、叉步反撩 44、丁步刺剑 45、丁步抱剑
46、行步穿剑 47、扣剑平抹 48、并步平刺
49、收势还原。</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 6,
            username: 'admin',
            title_img: require('@/assets/esoter/wudang06.jpg'),
            title:
              '武当龙行长穗剑势一路鲜为人知的内家剑术套路，它具有步走八卦，剑似龙行的显著特点。',
            click_num: 95,
            create_time: '2020-06-29 14:10:16',
            content: `<h2>武当龙行长穗剑</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;其步法左旋右转环转无端，其剑法挂撩点刺，穿抹云扫，环环相扣变幻莫测。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;演练起穗随剑舞，剑随身变，圆活流畅，潇洒而飘逸。时而如金蛇狂舞，时而如游龙在天，时而如轻风拂柳，时而如疾风闪电，势势相承如长河飞瀑，连绵不绝似行云流水。许多剑法都是在疾速的旋转绕行和翻转拧裹中完成的，往往形成一势多圆，曲折回环，跌宕起伏的奇特效果，令人眼花缭乱，目不暇接。</p>
            <h2>第一段</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;预备势1、金龙探爪2、拨云见日3、乌龙摆尾
4、反手摸天5、翻江倒海6、小龙戏水7、顺水扬波
8、天花乱坠9、推波助澜10、龙飞凤舞11、追星赶月
12、苍龙入海13、倒插杨柳14、金龙狂舞15、瞒天过海
16、风卷残云17、青龙吐须</p>
<h2>第二段</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;18、小龙戏水19、顺水扬波20、天花乱坠21、兴风作浪
22、海底捞月23、流星赶月24、苍龙入海25、金龙狂舞
26、移星换斗27、满天风雨28、瞒天过海29、斗转星移
30、玉龙旋风</p>
<h2>第三段</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;31、顽石点头32、回头是岸33、小龙戏水34、顺水扬波
35、天花乱坠36、耕云种月37、倒插杨柳38、金龙狂舞
39、浪子回头</p>
<h2>第四段</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;40、顺水扬波41、蛟龙入海42、流星赶月43、蛰龙伏穴
44、金龙狂舞45、偷天换日46、独步九天收势</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 7,
            username: 'admin',
            title_img: require('@/assets/esoter/wudang07.jpg'),
            title:
              '武当拂尘为道教法器之一，亦是道教弟子清净云游之物。后经演变，成为一种独具风格的软兵器。',
            click_num: 164,
            create_time: '2020-01-16 12:35:11',
            content: `<h2>拂尘套路。</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;武当拂尘是一路鲜为人知的道家秘传武术套路，它除具有健身防身的作用外，亦有很高的表演价值。其动作刚柔相济，缓急相兼，舒展圆活，潇洒飘逸，具有步走八卦，腰如蛇行的显著特点。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;武当拂尘结构严谨，短小精练，布局合理，能收能放，演练时不择场地，虽卧牛之地亦可。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;主要方法有上抽、下扫、甩摔、里缠外绕、盘绞挑抖等。其特点是，舒展圆活，潇洒飘逸；步走八卦，腰如蛇行；扣扣如环，节节上连；以柔克刚，刚柔相济。</p>
            <h2>功法名称</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;起势
1、旋转乾坤
2、黄龙盖顶
3、老龟探路
4、脚踏五行
5、黑虎开路
6、横扫千军
7、翻江倒海
8、马后扬鞭
9、灵猴缩身
10、小鬼缠竹
11、横断巫山
12、拨云见日
13、左顾右盼
14、白猿献果
15、夜叉探海
16、乌龙摆尾
17、白马弹腿
18、流星赶月
19、降龙伏虎
20、回头望月
21、直捣黄龙
22、扫鞭催马
23、平衡阴阳
24、太公坐昆仑收势</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          },
          {
            id: 8,
            username: 'admin',
            title_img: require('@/assets/esoter/wudang08.jpg'),
            title: '丹派剑术是古代武当山道教的镇山剑法之一。据传由张三丰所创',
            click_num: 137,
            create_time: '2020-06-17 15:27:32',
            content: `<h2>武当丹派剑术</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;属于丹派，行剑讲究一剑多用，变在动中，奇正相生。以十三法为核心：点、崩、撩、挂、云、抹、扫、穿、拦 、圈、领、劈、带贯穿其中，行剑如龙之行，首尾相应，刚柔相济，神韵悠然自得。</p>
            <h2>起源</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;先从“丹”字说起。丹字的本义，原指丹砂，俗称朱砂。因古代道家用炉火烧炼药物时多采用朱砂，炼成之物称为“金丹”、“仙丹”，以后就泛指各种精制的药体，如丸散丹膏，灵丹妙药等。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;再说炼丹。它有外丹与内丹之分。古代道家用鼎炉烧炼药石成丹者称外丹；而修炼精气神，在人体内结丹者称作内丹，也称金丹。修炼内丹所在的丹田，是人体经络的重要穴位，是真气(元气)聚结以及结丹存丹之处。因而古人说：“丹者，一炁之所结也。”它通过炼精化气、炼气化神、神气相合等过程而结成内丹，能养生长寿，返老还童，甚至说能得道成仙。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;武当派始祖张三丰，虽出身北宗传人，而丹法却承接南宗，融会贯通，且具特色，主张性命双修，三教同流。所著《张三丰全集》，是道家内丹学史上的一部名著，也是武当丹派武功行功走架的指南。</p>
            <h2>剑术简介</h2>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;清末奉天北镇县宋唯依著《武当丹派剑术》、《武当九派源流》，武当剑术乃洞玄真人张三峰受真武之大法，嗣后祖师立成九派，分为三乘，以下乘为在世之法。所谓九派，有九字相区别。即：字、柱、极、符、鉴、七、釜、筹、丹。所谓三乘，上乘乃偃月神术，占字、柱、极三字之派；中乘乃匕首飞术，占符、鉴、七三字之派；下乘乃长剑舞术，占釜、筹、丹三字之派。又总以三乘之神、飞、舞三字贯于九派九字之中。即自一生三，三生九之义。宋唯依的下乘丹派剑术，得自野鹤道人传授。清同治八年(1869年)续谱时，习丹字派者8人。其师承源流为：明嘉靖时，河南登丰县人张松溪继传武当剑术于浙东之四明山，道号丹崖子，后传给明万历时泰安县人赵太斌，号丹云山樵；续传清顺治时湖北均县人王九成，号武当丹绪；续传康熙时湖南衡山颜昔圣，号定丹叟；续传浙江鄞县人吕十娘，号丹霞客；续传乾隆时陕西华阴人李大年，号金丹赤子；续传安徽人陈荫昌，号丹云旅者；续传道光时直隶曲阳人张野鹤，号还丹子；九传至清末奉天北镇县人宋唯依，号飞丹九儿。此仅为“丹”字派承传关系。“内家丹字真谛”云：三峰祖师取《易》道为剑法，随时变易，以从天道。故剑术大法，取诸八卦为8场，以64卦为64势，以384爻为384手。若要以时变易，一卦一时，则64卦不同，剑之64势亦不同。一爻一时，则384爻不同，剑之384手亦不同。时之百千万变化无穷，而剑之所以百千万变亦无穷。故日剑无成法，因敌变化而制胜。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;昔日祖师教剑，先练内勇，次练外功，最后教以手法、步法。三年之后，追诸断崖绝壁之上，经月疾驰，能以竹枝刺猿猱而中者，方授以剑术之真谛。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;练此剑术，非寻常击剑可比，因作歌曰：“吾入学剑，习练功纯，自能入妙，神手其神，翻天兮惊飞鸟，滚地兮不沾尘。一击之间，恍若轻风不见剑，万变之中，但见剑光不见人。”此是九转还原之功夫，即古称为妙手空空即是术也。关于铸剑之尺寸，分为三等：上制九锵(每锵6两5钱)九尺，上士服之；中制六锵六尺，中士服之；下制三锵三尺，下士服之。既至功成圆满，所用之剑，不过三尺六寸，至十九两五钱，以应三(剑)六(乾卦)九五(爻位)之数。总之，即是三剑化为一剑，以应乾卦九五飞龙在天之义。故名曰“飞龙剑”。</p>`,
            video_url: require('@/assets/esoter/video/少林罗汉拳.mp4')
          }
        ]
      }
    }
  },
  computed: {},
  watch: {},
  created() {},
  mounted() {},
  methods: {}
}
</script>

<style scoped lang="less"></style>
